app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT * FROM `assignments`

  def show
    @assignment = Assignment.find(params[:id])
---
SELECT * FROM `assignments` WHERE (`assignments`.`id` = 1)

  def edit
    @assignment = Assignment.find(params[:id])
---
SELECT * FROM `assignments` WHERE (`assignments`.`id` = 1)

  def create
    @assignment = Assignment.new(params[:assignment])

    respond_to do |format|
      if @assignment.save
---
INSERT INTO `assignments` (`updated_at`, `task_id`, `fte_load`, `person_id`, `created_at`) VALUES('2009-12-13 07:04:34', NULL, NULL, NULL, '2009-12-13 07:04:34')

  def update
    @assignment = Assignment.find(params[:id])

    respond_to do |format|
      if @assignment.update_attributes(params[:assignment])
---
SELECT * FROM `assignments` WHERE (`assignments`.`id` = 1)
UPDATE `assignments` SET `person_id` = 3, `updated_at` = '2009-12-13 05:48:08' WHERE `id` = 2

  def destroy
    @assignment = Assignment.find(params[:id])
    @assignment.destroy
---
SELECT * FROM `assignments` WHERE (`assignments`.`id` = 1)
DELETE FROM `assignments` WHERE `id` = 1