app/controllers/certifiers_controller.rb

  def index
    @certifiers = Certifier.all
---
SELECT * FROM `certifiers`

  def show
    @certifier = Certifier.find(params[:id])
---
SELECT * FROM `certifiers` WHERE (`certifiers`.`id` = 1)

  def edit
    @certifier = Certifier.find(params[:id])
---
SELECT * FROM `certifiers` WHERE (`certifiers`.`id` = 1)

  def create
    @certifier = Certifier.new(params[:certifier])

    respond_to do |format|
      if @certifier.save
---
INSERT INTO `certifiers` (`name`, `updated_at`, `website`, `logo_image_url`, `description`, `created_at`) VALUES(NULL, '2010-01-11 07:04:02', NULL, NULL, NULL, '2010-01-11 07:04:02')

  def update
    @certifier = Certifier.find(params[:id])
---
SELECT * FROM `certifiers` WHERE (`certifiers`.`id` = 1)

  def destroy
    @certifier = Certifier.find(params[:id])
    @certifier.destroy
---
SELECT * FROM `certifiers` WHERE (`certifiers`.`id` = 1)
DELETE FROM `certifiers` WHERE `id` = 1