app/controllers/contact_details_controller.rb

SELECT * FROM `contact_details`
---
  def index
    @contact_details = ContactDetail.all

SELECT * FROM `contact_details` WHERE (`contact_details`.`id` = 1)
---
  def show
    @contact_detail = ContactDetail.find(params[:id])

SELECT * FROM `contact_details` WHERE (`contact_details`.`id` = 1)
---
  def edit
    @contact_detail = ContactDetail.find(params[:id])

INSERT INTO `contact_details` (`city`, `updated_at`, `postcode`, `country`, `suburb_town`, `address_line_1`, `address_line_2`, `state`, `created_at`) VALUES(NULL, '2010-01-08 22:00:57', NULL, NULL, NULL, NULL, NULL, NULL, '2010-01-08 22:00:57')
---
  def create
    @contact_detail = ContactDetail.new(params[:contact_detail])

    respond_to do |format|
      if @contact_detail.save

SELECT * FROM `contact_details` WHERE (`contact_details`.`id` = 1)
---
  def update
    @contact_detail = ContactDetail.find(params[:id])

SELECT * FROM `contact_details` WHERE (`contact_details`.`id` = 1)
DELETE FROM `contact_details` WHERE `id` = 1
---
  def destroy
    @contact_detail = ContactDetail.find(params[:id])
    @contact_detail.destroy