app/controllers/contact_detail_types_controller.rb

  def index
    @contact_detail_types = ContactDetailType.all
---
SELECT * FROM `contact_detail_types`

  def show
    @contact_detail_type = ContactDetailType.find(params[:id])
---
SELECT * FROM `contact_detail_types` WHERE (`contact_detail_types`.`id` = 1)

  def edit
    @contact_detail_type = ContactDetailType.find(params[:id])
---
SELECT * FROM `contact_detail_types` WHERE (`contact_detail_types`.`id` = 1)

  def create
    @contact_detail_type = ContactDetailType.new(params[:contact_detail_type])

    respond_to do |format|
      if @contact_detail_type.save
---
INSERT INTO `contact_detail_types` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:57', NULL, '2010-01-08 22:00:57')

  def update
    @contact_detail_type = ContactDetailType.find(params[:id])
---
SELECT * FROM `contact_detail_types` WHERE (`contact_detail_types`.`id` = 1)

  def destroy
    @contact_detail_type = ContactDetailType.find(params[:id])
    @contact_detail_type.destroy
---
SELECT * FROM `contact_detail_types` WHERE (`contact_detail_types`.`id` = 1)
DELETE FROM `contact_detail_types` WHERE `id` = 1