app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
---
SELECT * FROM `payments`

  def show
    @payment = Payment.find(params[:id])
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 980190962)

  def new
    @payment = Payment.new
    @customers = User.customers.map{|t| [t.pretty_name, t.id]}
    @payment_types = PaymentType.find(:all).map{|t| [t.name.titleize, t.id]}
---
SELECT * FROM `users` WHERE (is_customer = 1)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def edit
    @payment = Payment.find(params[:id])
    @customers = User.customers.map{|t| [t.pretty_name, t.id]}
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 980190962)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def create
    @payment = Payment.new(params[:payment])
    @customers = User.customers.map{|t| [t.pretty_name, t.id]}
    @payment_types = PaymentType.find(:all).map{|t| [t.name.titleize, t.id]}

    if @payment.save
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 4)
SELECT `payment_types`.id FROM `payment_types` WHERE (`payment_types`.`name` IS NULL) LIMIT 1
INSERT INTO `payments` (`payment_type_id`, `updated_at`, `amount`, `user_id`, `created_by_user_id`, `comment`, `received_at`, `created_at`) VALUES(NULL, '2010-01-08 22:00:57', NULL, NULL, NULL, NULL, NULL, '2010-01-08 22:00:57')

  def update
    @payment = Payment.find(params[:id])
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 980190962)

  def destroy
    @payment = Payment.find(params[:id])
    user = @payment.user
    @payment.destroy
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 980190962)
DELETE FROM `payments` WHERE `id` = 980190962