app/controllers/payment_types_controller.rb

  def index
    @payment_types = PaymentType.all
---
SELECT * FROM `payment_types`

  def show
    @payment_type = PaymentType.find(params[:id])
---
SELECT * FROM `payment_types` WHERE (`payment_types`.`id` = 1)

  def edit
    @payment_type = PaymentType.find(params[:id])
---
SELECT * FROM `payment_types` WHERE (`payment_types`.`id` = 1)

  def create
    @payment_type = PaymentType.new(params[:payment_type])

    respond_to do |format|
      if @payment_type.save
---
INSERT INTO `payment_types` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:57', NULL, '2010-01-08 22:00:57')

  def update
    @payment_type = PaymentType.find(params[:id])
---
SELECT * FROM `payment_types` WHERE (`payment_types`.`id` = 1)

  def destroy
    @payment_type = PaymentType.find(params[:id])
    @payment_type.destroy
---
SELECT * FROM `payment_types` WHERE (`payment_types`.`id` = 1)
DELETE FROM `payment_types` WHERE `id` = 1