app/controllers/people_skills_controller.rb

  def index
    @people_skills = PeopleSkill.all
---
SELECT * FROM `people_skills`

  def show
    @people_skill = PeopleSkill.find(params[:id])
---
SELECT * FROM `people_skills` WHERE (`people_skills`.`id` = 1)

  def edit
    @people_skill = PeopleSkill.find(params[:id])
---
SELECT * FROM `people_skills` WHERE (`people_skills`.`id` = 1)

  def create
    @people_skill = PeopleSkill.new(params[:people_skill])

    respond_to do |format|
      if @people_skill.save
---
INSERT INTO `people_skills` (`updated_at`, `person_id`, `skill_id`, `created_at`) VALUES('2009-12-13 07:04:34', NULL, NULL, '2009-12-13 07:04:34')

  def update
    @people_skill = PeopleSkill.find(params[:id])
---
SELECT * FROM `people_skills` WHERE (`people_skills`.`id` = 1)

  def destroy
    @people_skill = PeopleSkill.find(params[:id])
    @people_skill.destroy
---
SELECT * FROM `people_skills` WHERE (`people_skills`.`id` = 1)
DELETE FROM `people_skills` WHERE `id` = 1