app/controllers/physical_forms_controller.rb

  def index
    @physical_forms = PhysicalForm.all
---
SELECT * FROM `physical_forms`

  def show
    @physical_form = PhysicalForm.find(params[:id])
---
SELECT * FROM `physical_forms` WHERE (`physical_forms`.`id` = 1)

  def edit
    @physical_form = PhysicalForm.find(params[:id])
---
SELECT * FROM `physical_forms` WHERE (`physical_forms`.`id` = 1)

  def create
    @physical_form = PhysicalForm.new(params[:physical_form])

    respond_to do |format|
      if @physical_form.save
---
INSERT INTO `physical_forms` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:58', NULL, '2010-01-08 22:00:58')

  def update
    @physical_form = PhysicalForm.find(params[:id])
---
SELECT * FROM `physical_forms` WHERE (`physical_forms`.`id` = 1)

  def destroy
    @physical_form = PhysicalForm.find(params[:id])
    @physical_form.destroy
---
SELECT * FROM `physical_forms` WHERE (`physical_forms`.`id` = 1)
DELETE FROM `physical_forms` WHERE `id` = 1