app/controllers/products_controller.rb

  def index
    @products = Product.find(:all, :order => 'product_type_id')
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)