app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    @products = Product.all

SELECT * FROM `products` WHERE (`products`.`id` = 980190962)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 980190962)
---
  def edit
    @product = Product.find(params[:id])

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
SELECT * FROM `products` WHERE (`products`.`id` = 1)
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 1)
SELECT * FROM `certifiers` WHERE (`certifiers`.`id` = 1)
INSERT INTO `products` (`name`, `image_url`, `updated_at`, `supplier_reference`, `stock_quantity`, `certifier_id`, `storage_location_id`, `description`, `storage_type_id`, `supplier_id`, `physical_form_id`, `product_type_id`, `units_of_measure_id`, `stock_unit_cost`, `created_at`) VALUES('test', NULL, '2010-01-12 09:54:47', NULL, NULL, 1, NULL, NULL, NULL, 1, NULL, 1, 1, NULL, '2010-01-12 09:54:47')
---
  def create
    @product = Product.new(params[:product])

    @product_types = ProductType.find(:all).map{|t| [t.name.titleize, t.id]}
    @suppliers = Supplier.find(:all).map{|t| [t.name.titleize, t.id]}
    @units_of_measure = UnitsOfMeasure.find(:all, :order => 'id').map{|t| [t.name, t.id]}
    @storage_types = StorageType.find(:all).map{|t| [t.name.titleize, t.id]}
    @storage_locations = StorageLocation.find(:all).map{|t| [t.name.titleize, t.id]}
    @physical_forms = PhysicalForm.find(:all).map{|t| [t.name.titleize, t.id]}
    @certifiers = Certifier.find(:all).map{|t| [t.name.titleize, t.id]}

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 980190962)
SELECT * FROM `product_types` WHERE (`product_types`.`id` = 2)
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 3)
SELECT * FROM `certifiers` WHERE (`certifiers`.`id` = 3)
UPDATE `products` SET `supplier_id` = 7, `certifier_id` = 5, `product_type_id` = 5, `updated_at` = '2010-01-11 09:53:46' WHERE `id` = 980190964
---
  def update
    @product = Product.find(params[:id])

    @product_types = ProductType.find(:all).map{|t| [t.name.titleize, t.id]}
    @suppliers = Supplier.find(:all).map{|t| [t.name.titleize, t.id]}
    @units_of_measure = UnitsOfMeasure.find(:all, :order => 'id').map{|t| [t.name, t.id]}
    @storage_types = StorageType.find(:all).map{|t| [t.name.titleize, t.id]}
    @storage_locations = StorageLocation.find(:all).map{|t| [t.name.titleize, t.id]}
    @physical_forms = PhysicalForm.find(:all).map{|t| [t.name.titleize, t.id]}
    @certifiers = Certifier.find(:all).map{|t| [t.name.titleize, t.id]}

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM `products` WHERE (`products`.`id` = 980190962)
DELETE FROM `products` WHERE `id` = 980190962
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy