app/controllers/product_types_controller.rb

SELECT * FROM `product_types`
---
  def index
    @product_types = ProductType.all

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
---
  def show
    @product_type = ProductType.find(params[:id])

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
---
  def edit
    @product_type = ProductType.find(params[:id])

INSERT INTO `product_types` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-11 07:04:04', NULL, '2010-01-11 07:04:04')
---
  def create
    @product_type = ProductType.new(params[:product_type])

    if @product_type.save

SELECT * FROM `product_types` WHERE (`product_types`.`id` = 1)
---
  def update
    @product_type = ProductType.find(params[:id])