app/controllers/product_prices_controller.rb

  def index
    @product_prices = ProductPrice.all
---
SELECT * FROM `product_prices`

  def show
    @product_price = ProductPrice.find(params[:id])
---
SELECT * FROM `product_prices` WHERE (`product_prices`.`id` = 980190962)

  def edit
    @product_price = ProductPrice.find(params[:id])
---
SELECT * FROM `product_prices` WHERE (`product_prices`.`id` = 980190962)

  def create
    @product_price = ProductPrice.new(params[:product_price])

    respond_to do |format|
      if @product_price.save
---
INSERT INTO `product_prices` (`updated_at`, `product_id`, `amount`, `comment`, `created_at`) VALUES('2010-01-08 22:00:58', NULL, NULL, NULL, '2010-01-08 22:00:58')

  def update
    @product_price = ProductPrice.find(params[:id])
---
SELECT * FROM `product_prices` WHERE (`product_prices`.`id` = 980190962)

  def destroy
    @product_price = ProductPrice.find(params[:id])
    @product_price.destroy
---
SELECT * FROM `product_prices` WHERE (`product_prices`.`id` = 980190962)
DELETE FROM `product_prices` WHERE `id` = 980190962