app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2009-12-13 07:04:34', NULL, '2009-12-13 07:04:34')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `description` = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', `updated_at` = '2009-12-13 06:42:53' WHERE `id` = 3

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1