app/controllers/purchase_orders_controller.rb

SELECT * FROM `purchase_orders`
---
  def index
    @purchase_orders = PurchaseOrder.all

SELECT * FROM `purchase_orders` WHERE (`purchase_orders`.`id` = 980190962)
---
  def show
    @purchase_order = PurchaseOrder.find(params[:id])

SELECT * FROM `purchase_orders` WHERE (`purchase_orders`.`id` = 980190962)
SELECT * FROM `products` WHERE (`products`.`id` = 2)
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 3)
---
  def edit
    @purchase_order = PurchaseOrder.find(params[:id])
    @available_products = @available_products = ["Select ..."] + Product.find(:all, :conditions => ['supplier_id = ?', @purchase_order.supplier_id]).map{|p| [p.name + ' [per ' + p.units_of_measure.name + ']', p.id]}

INSERT INTO `purchase_orders` (`updated_at`, `purchase_order_id`, `is_received`, `is_paid`, `amount`, `supplier_id`, `is_created`, `created_by_user_id`, `comment`, `created_at`) VALUES('2010-01-12 08:39:24', NULL, NULL, NULL, 0.0, 1, NULL, NULL, NULL, '2010-01-12 08:39:24')
---
  def create
    @purchase_order = PurchaseOrder.new(params[:purchase_order])

    if @purchase_order.save

SELECT * FROM `purchase_orders` WHERE (`purchase_orders`.`id` = 980190962)
---
  def update
    @purchase_order = PurchaseOrder.find(params[:id])

SELECT * FROM `purchase_orders` WHERE (`purchase_orders`.`id` = 980190962)
DELETE FROM `purchase_orders` WHERE `id` = 980190962
---
  def destroy
    @purchase_order = PurchaseOrder.find(params[:id])
    @purchase_order.destroy