app/controllers/purchase_order_states_controller.rb

  def index
    @purchase_order_states = PurchaseOrderState.all
---
SELECT * FROM `purchase_order_states`

  def show
    @purchase_order_state = PurchaseOrderState.find(params[:id])
---
SELECT * FROM `purchase_order_states` WHERE (`purchase_order_states`.`id` = 1)

  def edit
    @purchase_order_state = PurchaseOrderState.find(params[:id])
---
SELECT * FROM `purchase_order_states` WHERE (`purchase_order_states`.`id` = 1)

  def create
    @purchase_order_state = PurchaseOrderState.new(params[:purchase_order_state])

    respond_to do |format|
      if @purchase_order_state.save
---
INSERT INTO `purchase_order_states` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:58', NULL, '2010-01-08 22:00:58')

  def update
    @purchase_order_state = PurchaseOrderState.find(params[:id])
---
SELECT * FROM `purchase_order_states` WHERE (`purchase_order_states`.`id` = 1)

  def destroy
    @purchase_order_state = PurchaseOrderState.find(params[:id])
    @purchase_order_state.destroy
---
SELECT * FROM `purchase_order_states` WHERE (`purchase_order_states`.`id` = 1)
DELETE FROM `purchase_order_states` WHERE `id` = 1