app/controllers/purchase_order_items_controller.rb

  def index
    @purchase_order_items = PurchaseOrderItem.all
---
SELECT * FROM `purchase_order_items`

  def show
    @purchase_order_item = PurchaseOrderItem.find(params[:id])
---
SELECT * FROM `purchase_order_items` WHERE (`purchase_order_items`.`id` = 980190962)

  def edit
    @purchase_order_item = PurchaseOrderItem.find(params[:id])
---
SELECT * FROM `purchase_order_items` WHERE (`purchase_order_items`.`id` = 980190962)

  def create
    @purchase_order = PurchaseOrder.find(params[:id])
    @purchase_order_item = PurchaseOrderItem.new
    @purchase_order_item.purchase_order_id = @purchase_order.id
    @purchase_order_item.product_id = params[:product]
    @purchase_order_item.quantity = params[:quantity]

    respond_to do |format|
      if @purchase_order_item.save
---
SELECT * FROM `purchase_orders` WHERE (`purchase_orders`.`id` = 1)
INSERT INTO `purchase_order_items` (`updated_at`, `price`, `purchase_order_id`, `product_id`, `quantity`, `created_at`) VALUES('2010-01-12 18:58:12', 0.0, 1, 1, NULL, '2010-01-12 18:58:12')

  def update
    @purchase_order_item = PurchaseOrderItem.find(params[:id])

    respond_to do |format|
      if @purchase_order_item.update_attributes(params[:purchase_order_item])
---
SELECT * FROM `purchase_order_items` WHERE (`purchase_order_items`.`id` = 980190962)
UPDATE `purchase_order_items` SET `purchase_order_id` = 2, `quantity` = 12, `updated_at` = '2010-01-12 20:29:29' WHERE `id` = 298486374

  def destroy
    @purchase_order_item = PurchaseOrderItem.find(params[:id])
    @purchase_order = @purchase_order_item.purchase_order
    @purchase_order_item.destroy
---
SELECT * FROM `purchase_order_items` WHERE (`purchase_order_items`.`id` = 980190962)
DELETE FROM `purchase_order_items` WHERE `id` = 980190962