app/controllers/sales_order_items_controller.rb

  def create
    @sales_order = SalesOrder.find(params[:id])
---
SELECT * FROM `sales_orders` WHERE (`sales_orders`.`id` = 1)