app/controllers/sales_orders_controller.rb

  def create
    basket = find_basket

    # Create Sales Order
    sales_order = SalesOrder.create(:customer_id => params[:customer_id], :private_comment => params[:private_comment], :public_comment => params[:public_comment])
---
INSERT INTO `sales_orders` (`updated_at`, `is_invoiced`, `is_paid`, `is_ordered`, `user_id`, `created_by_user_id`, `comment`, `invoiced_at`, `invoice_amount`, `created_at`) VALUES('2010-01-12 10:00:32', NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, '2010-01-12 10:00:32')

  def update
    if @sales_order.update_attributes(params[:sales_order])
---
UPDATE `sales_orders` SET `is_invoiced` = 1, `updated_at` = '2010-01-14 22:33:07' WHERE `id` = 1

  def find_products_for_selection
    if params[:product_type]
      product_type = ProductType.find(params[:product_type])
      product_type.products.ordered_by_name
    elsif params[:supplier]
      supplier = Supplier.find(params[:supplier])
---
SELECT * FROM `product_types` WHERE (`product_types`.`id` = 2)
SELECT * FROM `product_types`
SELECT * FROM `products` WHERE (`products`.`id` = 1)
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)

    def find_order
      @sales_order = SalesOrder.find(params[:id])
---
SELECT * FROM `sales_orders` WHERE (`sales_orders`.`id` = 980190962)