app/controllers/sales_order_items_controller.rb

  def index
    @sales_order_items = SalesOrderItem.all
---
SELECT * FROM `sales_order_items`

  def show
    @sales_order_item = SalesOrderItem.find(params[:id])
---
SELECT * FROM `sales_order_items` WHERE (`sales_order_items`.`id` = 980190962)

  def edit
    @sales_order_item = SalesOrderItem.find(params[:id])
---
SELECT * FROM `sales_order_items` WHERE (`sales_order_items`.`id` = 980190962)

  def create
    @sales_order_item = SalesOrderItem.new(params[:sales_order_item])

    respond_to do |format|
      if @sales_order_item.save
---
INSERT INTO `sales_order_items` (`updated_at`, `price`, `product_id`, `quantity`, `percentage_discount`, `sales_order_id`, `created_at`) VALUES('2010-01-12 10:07:38', 0.0, 1, NULL, NULL, 1, '2010-01-12 10:07:38')

  def update
    @sales_order_item = SalesOrderItem.find(params[:id])
---
SELECT * FROM `sales_order_items` WHERE (`sales_order_items`.`id` = 980190962)

  def destroy
    @sales_order_item = SalesOrderItem.find(params[:id])
    @sales_order_item.destroy
---
SELECT * FROM `sales_order_items` WHERE (`sales_order_items`.`id` = 980190962)
DELETE FROM `sales_order_items` WHERE `id` = 980190962