app/controllers/sales_orders_controller.rb

SELECT * FROM `sales_orders`
---
  def index
    @sales_orders = SalesOrder.all

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
  def new
    @sales_order = SalesOrder.new
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (is_customer = 1)
---
  def create
    user = User.find(params[:id])

DELETE FROM `sales_orders` WHERE `id` = 980190962
---
  def destroy
    @sales_order = SalesOrder.find(params[:id])
    @user = @sales_order.user
    @sales_order.destroy