app/controllers/sales_order_states_controller.rb

SELECT * FROM `sales_order_states`
---
  def index
    @sales_order_states = SalesOrderState.all

SELECT * FROM `sales_order_states` WHERE (`sales_order_states`.`id` = 1)
---
  def show
    @sales_order_state = SalesOrderState.find(params[:id])

SELECT * FROM `sales_order_states` WHERE (`sales_order_states`.`id` = 1)
---
  def edit
    @sales_order_state = SalesOrderState.find(params[:id])

INSERT INTO `sales_order_states` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:58', NULL, '2010-01-08 22:00:58')
---
  def create
    @sales_order_state = SalesOrderState.new(params[:sales_order_state])

    respond_to do |format|
      if @sales_order_state.save

SELECT * FROM `sales_order_states` WHERE (`sales_order_states`.`id` = 1)
UPDATE `sales_order_states` SET `description` = '', `updated_at` = '2010-01-11 09:58:34', `name` = 'Ordered' WHERE `id` = 1
---
  def update
    @sales_order_state = SalesOrderState.find(params[:id])

    respond_to do |format|
      if @sales_order_state.update_attributes(params[:sales_order_state])

SELECT * FROM `sales_order_states` WHERE (`sales_order_states`.`id` = 1)
DELETE FROM `sales_order_states` WHERE `id` = 1
---
  def destroy
    @sales_order_state = SalesOrderState.find(params[:id])
    @sales_order_state.destroy