app/controllers/skills_controller.rb

SELECT * FROM `skills`
---
  def index
    @skills = Skill.all

SELECT * FROM `skills` WHERE (`skills`.`id` = 1)
---
  def show
    @skill = Skill.find(params[:id])

SELECT * FROM `skills` WHERE (`skills`.`id` = 1)
---
  def edit
    @skill = Skill.find(params[:id])

INSERT INTO `skills` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2009-12-13 07:04:34', NULL, '2009-12-13 07:04:34')
---
  def create
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save

SELECT * FROM `skills` WHERE (`skills`.`id` = 1)
---
  def update
    @skill = Skill.find(params[:id])

SELECT * FROM `skills` WHERE (`skills`.`id` = 1)
DELETE FROM `skills` WHERE `id` = 1
---
  def destroy
    @skill = Skill.find(params[:id])
    @skill.destroy