app/controllers/storage_types_controller.rb

  def index
    @storage_types = StorageType.all
---
SELECT * FROM `storage_types`

  def show
    @storage_type = StorageType.find(params[:id])
---
SELECT * FROM `storage_types` WHERE (`storage_types`.`id` = 1)

  def edit
    @storage_type = StorageType.find(params[:id])
---
SELECT * FROM `storage_types` WHERE (`storage_types`.`id` = 1)

  def create
    @storage_type = StorageType.new(params[:storage_type])

    respond_to do |format|
      if @storage_type.save
---
INSERT INTO `storage_types` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:59', NULL, '2010-01-08 22:00:59')

  def update
    @storage_type = StorageType.find(params[:id])
---
SELECT * FROM `storage_types` WHERE (`storage_types`.`id` = 1)

  def destroy
    @storage_type = StorageType.find(params[:id])
    @storage_type.destroy
---
SELECT * FROM `storage_types` WHERE (`storage_types`.`id` = 1)
DELETE FROM `storage_types` WHERE `id` = 1