app/controllers/storage_locations_controller.rb

  def index
    @storage_locations = StorageLocation.all
---
SELECT * FROM `storage_locations`

  def show
    @storage_location = StorageLocation.find(params[:id])
---
SELECT * FROM `storage_locations` WHERE (`storage_locations`.`id` = 1)

  def edit
    @storage_location = StorageLocation.find(params[:id])
---
SELECT * FROM `storage_locations` WHERE (`storage_locations`.`id` = 1)

  def create
    @storage_location = StorageLocation.new(params[:storage_location])

    respond_to do |format|
      if @storage_location.save
---
INSERT INTO `storage_locations` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2010-01-08 22:00:59', NULL, '2010-01-08 22:00:59')

  def update
    @storage_location = StorageLocation.find(params[:id])
---
SELECT * FROM `storage_locations` WHERE (`storage_locations`.`id` = 1)

  def destroy
    @storage_location = StorageLocation.find(params[:id])
    @storage_location.destroy
---
SELECT * FROM `storage_locations` WHERE (`storage_locations`.`id` = 1)
DELETE FROM `storage_locations` WHERE `id` = 1