app/controllers/suppliers_controller.rb

SELECT * FROM `suppliers`
---
  def index
    @suppliers = Supplier.all

SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)
---
  def show
    @supplier = Supplier.find(params[:id])

SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)
---
  def edit
    @supplier = Supplier.find(params[:id])

INSERT INTO `suppliers` (`name`, `account_name`, `city`, `phone_mobile`, `updated_at`, `postcode`, `country`, `website`, `delivery_rules`, `suburb_town`, `phone_home`, `description`, `address_line_1`, `phone_work`, `address_line_2`, `account_number`, `comment`, `email`, `state`, `created_at`) VALUES(NULL, NULL, NULL, NULL, '2010-02-03 12:31:10', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-02-03 12:31:10')
---
  def create
    @supplier = Supplier.new(params[:supplier])
    if @supplier.save

SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)
---
  def update
    @supplier = Supplier.find(params[:id])