app/controllers/suppliers_contact_details_controller.rb

  def index
    @suppliers_contact_details = SuppliersContactDetail.all
---
SELECT * FROM `suppliers_contact_details`

  def show
    @suppliers_contact_detail = SuppliersContactDetail.find(params[:id])
---
SELECT * FROM `suppliers_contact_details` WHERE (`suppliers_contact_details`.`id` = 980190962)

  def edit
    @suppliers_contact_detail = SuppliersContactDetail.find(params[:id])
---
SELECT * FROM `suppliers_contact_details` WHERE (`suppliers_contact_details`.`id` = 980190962)

  def create
    @suppliers_contact_detail = SuppliersContactDetail.new(params[:suppliers_contact_detail])

    respond_to do |format|
      if @suppliers_contact_detail.save
---
INSERT INTO `suppliers_contact_details` (`updated_at`, `contact_detail_type_id`, `supplier_id`, `contact_detail_id`, `created_at`) VALUES('2010-01-11 07:04:06', NULL, NULL, NULL, '2010-01-11 07:04:06')

  def update
    @suppliers_contact_detail = SuppliersContactDetail.find(params[:id])
---
SELECT * FROM `suppliers_contact_details` WHERE (`suppliers_contact_details`.`id` = 980190962)

  def destroy
    @suppliers_contact_detail = SuppliersContactDetail.find(params[:id])
    @suppliers_contact_detail.destroy
---
SELECT * FROM `suppliers_contact_details` WHERE (`suppliers_contact_details`.`id` = 980190962)
DELETE FROM `suppliers_contact_details` WHERE `id` = 980190962