app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM `tasks`

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`name`, `finish`, `updated_at`, `description`, `start`, `fte_load`, `skill_id`, `created_at`) VALUES('RADV', '2009-12-17', '2009-12-11 20:28:06', 'asdasda\r\nas\r\ndas\r\ndas\r\ndasdad', '2009-12-11', 0, 0, '2009-12-11 20:28:06')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
UPDATE `tasks` SET `fte_load` = 0, `updated_at` = '2009-12-12 19:54:38' WHERE `id` = 1

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
DELETE FROM `tasks` WHERE `id` = 1