app/controllers/units_of_measures_controller.rb

  def index
    @units_of_measures = UnitsOfMeasure.all
---
SELECT * FROM `units_of_measures`

  def show
    @units_of_measure = UnitsOfMeasure.find(params[:id])
---
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 1)

  def edit
    @units_of_measure = UnitsOfMeasure.find(params[:id])
---
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 1)

  def create
    @units_of_measure = UnitsOfMeasure.new(params[:units_of_measure])

    respond_to do |format|
      if @units_of_measure.save
---
INSERT INTO `units_of_measures` (`name`, `updated_at`, `description`, `short_name`, `created_at`) VALUES(NULL, '2010-01-08 22:00:59', NULL, NULL, '2010-01-08 22:00:59')

  def update
    @units_of_measure = UnitsOfMeasure.find(params[:id])
---
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 1)

  def destroy
    @units_of_measure = UnitsOfMeasure.find(params[:id])
    @units_of_measure.destroy
---
SELECT * FROM `units_of_measures` WHERE (`units_of_measures`.`id` = 1)
DELETE FROM `units_of_measures` WHERE `id` = 1