app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :conditions => ["is_customer = ?", true])
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190963) LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`is_staff`, `updated_at`, `is_supplier`, `account_balance_cached`, `crypted_password`, `username`, `password_salt`, `is_admin`, `lock_version`, `percentage_discount`, `persistence_token`, `first_name`, `is_customer`, `last_name`, `email`, `created_at`) VALUES(0, '2010-01-09 05:53:26', 0, 0.0, 'c91ec367ee37c6983e073a7f354bd2ee101ca16c7ca998085a400e648d0799db0ceda0df411db31555147507af947c5087eebf39121e862f8021614333388799', 'adrian', 'BgLhtT8bGVhmEyIcGwS5', 0, 0, 0, 'b36094ed57923e7a1beb277e27f86c1aecfb13210e57c591b8a2a838be2f130a6beded58b952432d1478234458e0ede66e46b4c763442aa4b1e8190daf5de123', 'Adrian', 1, 'Smith', 'adrian@gmail.com', '2010-01-09 05:53:26')

  def edit
    #@user = current_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `persistence_token` = '0cd6f5bf0291c3298a7c9e2eea74f8c597f4cda929abf04b2b779c3238b464fc97424be7830140d900ccc9f0856de4756960b581cbac5292b5bd8dd5d44366b5', `crypted_password` = '2c932a2be4f1fefdecb7646f175b88e41d03f54b1c5046fb7b14d474aa838717ff0fa6b726cc5ed0fadec00b6034d181419b7d0f3d3a5ef003a30d70be5d93e5', `updated_at` = '2009-12-17 08:45:35', `password_salt` = 'FQ4LIJK8mSHmI28iqZEr' WHERE `id` = 1

  def toggle_order_invoiced_status
    order = SalesOrder.find(params[:order_id])
    order.is_invoiced = !order.is_invoiced
    order.save!
---
SELECT * FROM `sales_orders` WHERE (`sales_orders`.`id` = 1)
UPDATE `sales_orders` SET `is_invoiced` = 1, `updated_at` = '2010-01-18 12:23:08' WHERE `id` = 1

  def toggle_order_paid_status
    order = SalesOrder.find(params[:order_id])
    order.is_paid = !order.is_paid
    order.is_invoiced = true if order.is_paid
    order.save!
---
SELECT * FROM `sales_orders` WHERE (`sales_orders`.`id` = 1)
UPDATE `sales_orders` SET `is_invoiced` = 1, `is_paid` = 1, `updated_at` = '2010-01-18 12:25:09' WHERE `id` = 1