app/controllers/users_contact_details_controller.rb

SELECT * FROM `users_contact_details`
---
  def index
    @users_contact_details = UsersContactDetail.all

SELECT * FROM `users_contact_details` WHERE (`users_contact_details`.`id` = 980190962)
---
  def show
    @users_contact_detail = UsersContactDetail.find(params[:id])

SELECT * FROM `users_contact_details` WHERE (`users_contact_details`.`id` = 980190962)
---
  def edit
    @users_contact_detail = UsersContactDetail.find(params[:id])

INSERT INTO `users_contact_details` (`updated_at`, `contact_detail_type_id`, `user_id`, `contact_detail_id`, `created_at`) VALUES('2010-01-08 22:00:59', NULL, NULL, NULL, '2010-01-08 22:00:59')
---
  def create
    @users_contact_detail = UsersContactDetail.new(params[:users_contact_detail])

    respond_to do |format|
      if @users_contact_detail.save

SELECT * FROM `users_contact_details` WHERE (`users_contact_details`.`id` = 980190962)
---
  def update
    @users_contact_detail = UsersContactDetail.find(params[:id])

SELECT * FROM `users_contact_details` WHERE (`users_contact_details`.`id` = 980190962)
DELETE FROM `users_contact_details` WHERE `id` = 980190962
---
  def destroy
    @users_contact_detail = UsersContactDetail.find(params[:id])
    @users_contact_detail.destroy