app/controllers/welcome_controller.rb

SELECT count(*) AS count_all FROM `users` WHERE (is_customer = 1)
SELECT count(*) AS count_all FROM `suppliers`
SELECT count(*) AS count_all FROM `products`
SELECT count(*) AS count_all FROM `purchase_orders`
SELECT count(*) AS count_all FROM `sales_orders`
---
  def index
    @customers_count = User.count(:all, :conditions => ["is_customer = ?", true])
    @suppliers_count = Supplier.count(:all)
    @products_count = Product.count(:all)
    @purchase_orders_count = PurchaseOrder.count(:all)
    @sales_orders_count = SalesOrder.count(:all)